"""
MimicGram - Smart Comment Generator
Anti-pattern comment generation
"""

import random

class CommentEngine:


    SHORT_TEXTS = [
                    "آدم قوی کسیه که وسط سخت‌ترین روزها هم آروم قدم برمی‌داره",
                    "موفقیت سهم کساییه که حتی وقتی خسته‌ان ادامه میدن",
                    "سکوت کن و بگذار نتیجه‌ها به جای تو حرف بزنن",
                    "زندگی با آدمای ضعیف مهربونه، اما با آدمای مصمم معامله می‌کنه",
                    "هرچی بیشتر زمین بخوری، قوی‌تر بلند میشی",
                    "از تنهایی نترس، خیلی از قوی‌ترین آدم‌ها تنها ساختن",
                    "وقتی هدفت بزرگ باشه، حرف مردم کوچیک میشه",
                    "صبور باش، هیچ چیز ارزشمندی یک شبه ساخته نمیشه",
                    "آدمی که خودش رو باور کنه، دنیا مجبور میشه باورش کنه",
                    "سختی‌ها امتحان نیستن، ابزار ساخته شدن تو هستن",
                    "همیشه یک قدم بیشتر از دیروزت جلو باش",
                    "هیچ‌کس جز خودت مسئول آینده‌ات نیست",
                    "اگه راه آسون بود، همه به مقصد می‌رسیدن",
                    "رویاهات رو بلندتر از ترسهات نگه دار",
                    "کسی که دلیلش رو بدونه، با هر چطوری کنار میاد",
                    "برنده‌ها متفاوت به دنیا نمیان، متفاوت فکر می‌کنن",
                    "دیر رسیدن بهتر از هرگز نرسیدنه",
                    "هر روز یه فرصت جدیده برای بهتر شدن",
                    "قوی بودن انتخابه، نه اتفاق",
                    "آروم پیش برو ولی هرگز توقف نکن",
                    "آدم بزرگ از شکست نمی‌ترسه، از تلاش نکردن می‌ترسه",
                    "به خودت ثابت کن، نه به دنیا",
                    "هیچ تاریکی‌ای همیشگی نیست",
                    "نتیجه‌های بزرگ از تصمیم‌های کوچک شروع میشن",
                    "تو از چیزی که فکر می‌کنی قوی‌تری",
                    "به جای بهونه، بهانه‌ها رو بسوزون",
                    "مسیر سخت، آدم‌های قوی می‌سازه",
                    "بهترین انتقام، موفقیته",
                    "خودت باش، دنیا نسخه کپی زیاد داره",
                    "امروزت رو جدی بگیر، فردا نتیجه‌ش رو می‌بینی"
                ]
    def generate(self):

        structure_type = random.choice(["emoji", "short", "mixed"])

        if structure_type == "emoji":
            return random.choice(self.BASE_REACTIONS)

        if structure_type == "short":
            return random.choice(self.SHORT_TEXTS)

        if structure_type == "mixed":
            return f"{random.choice(self.BASE_REACTIONS)} {random.choice(self.SHORT_TEXTS)}"
