"""
MimicGram - Smart Comment Generator
Anti-pattern comment generation
"""

import random

class CommentEngine:

    BASE_REACTIONS = [
        "🔥",
        "🤤",
        "💦",
        "🍑",
        "👙"
    ]

    SHORT_TEXTS = [
    "امروز یه فیلم جدید برات اضافه کردم، لینک عضویت توی بیو",
    "یک ویدیو تازه گذاشتم، پیش‌نمایش و دانلود کامل توی بیو",
    "فیلم جدیدم امروز آماده دیدنه، حتماً لینک بیو رو ببین",
    "میخوای ویدیو جدیدم رو ببینی؟ همه چیز از لینک بیو قابل دسترسه",
    "یک فیلم انحصاری گذاشتم، لینک عضویت توی بیو برات آماده‌ست",
    "ویدیو شبانه‌ای امروز اضافه کردم، سریع برو لینک بیو",
    "فیلم جدیدم خیلی داغ و جذابه، پیش‌نمایش و دانلود توی بیو",
    "امروز یه ویدیو کامل و جدید گذاشتم، لینک بیو رو از دست نده",
    "ویدیوی ویژه امروز آماده شد، برای دیدن لینک بیو",
    "فیلم تازه و با کیفیت آماده دیدنه، پیش‌نمایش و دانلود لینک بیو",
    "ویدیو رمانتیک و خاص امروز آماده شد، لینک عضویت توی بیو",
    "یک ویدیوی شبانه و جذاب اضافه کردم، پیش‌نمایش و دانلود لینک بیو",
    "میخوای ویدیو جدیدم رو ببینی؟ لینک بیو آماده‌ست",
    "امروز یک فیلم جدید اضافه شد، سریع برو لینک عضویت توی بیو",
    "ویدیوی کامل و تازه آماده دانلوده، لینک بیو",
    "فیلم انحصاری و جذاب اضافه شد، پیش‌نمایش و دانلود لینک بیو",
    "ویدیوی شبانه امروز آماده شد، لینک عضویت توی بیو",
    "ویدیوی جذاب و ویژه امروز، برای دیدن لینک بیو",
    "فیلم VIP و جدید گذاشتم، پیش‌نمایش و دانلود توی لینک بیو",
    "فیلم انحصاری امروز آماده شد، لینک بیو برای دیدن کامل",
    "میخوای ویدیو کامل امروز رو ببینی؟ لینک بیو برات آماده‌ست",
    "ویدیو جذاب و تازه امروز آماده‌ست، سریع برو لینک بیو",
    "فیلم شبانه و داغ امروز آماده شد، لینک عضویت توی بیو",
    "ویدیوی کامل و ویژه امروز، پیش‌نمایش و دانلود لینک بیو",
    "فیلم تازه اضافه شد، سریع برو لینک بیو",
    "ویدیوی ویژه امروز آماده شد، برای دانلود و پیش‌نمایش لینک بیو",
    "ویدیو جذاب و تازه آماده دیدنه، لینک عضویت توی بیو",
    "ویدیوی شبانه امروز اضافه شد، پیش‌نمایش و دانلود لینک بیو",
    "ویدیوی VIP و انحصاری امروز آماده شد، لینک بیو",
    "فیلم کامل و جذاب امروز آماده شد، برای دیدن لینک بیو"
     ]
    def generate(self):

        structure_type = random.choice(["emoji", "short", "mixed"])

        if structure_type == "emoji":
            return random.choice(self.BASE_REACTIONS)

        if structure_type == "short":
            return random.choice(self.SHORT_TEXTS)

        if structure_type == "mixed":
            return f"{random.choice(self.BASE_REACTIONS)} {random.choice(self.SHORT_TEXTS)}"
